<template>
  <div>
    <el-row>
      <el-col :span="8">
        <el-button @click="add('user')">随机添加用户</el-button>
        <el-button @click="add('goods')">随机添加商品</el-button>
        <div style="margin:10px">
          <el-input v-model="count" placeholder="添加数量" type="number" min="1"></el-input>
        </div>
      </el-col>
    </el-row>
  </div>
</template>

<script>
  import util from "@/util.js"
  import urls from "@/urls.js"
  export default {
    data() {
      let self = this;
      return {
        count: 10,
        user: {
          key: {
            key: "username",
            name: "用户名"
          },
          getData() {
            return {
              "username": self.getRandomChars(8),
              "password": self.getRandomChars(6),
              "mail": `${self.getRandomChars(5)}@${self.getRandomChars(6)}.com`,
              "nickname": self.getName(),
              "tel": `130${self.getRandomChars(8,'num')}`
            };
          }
        },
        goods: {
          key: {
            key: "gid",
            name: "商品id"
          },
          getData() {
            return {
              "status" : "1",
              "gid" : self.getRandomChars(8),
              "name" : self.getGoods(),
              "charge" : 50 + self.getRandomInt(1000),
              "count" : 1 + self.getRandomInt(200),
              "category" : self.getGoodsCtegory(),
            };
          }
        },
        customer: {
          key: 'cid',
          getData() {
            return {};
          }
        }
      }
    },
    methods: {
      add(table) {
        let count = this.count;
        let key = this[table].key;
        let getData = this[table].getData;
        for (let i = 0; i < count; i++) {
          util.method.addData(table, key, getData());
          // console.log(table, key, getData());
        }
        alert("done");
      },
      getRandomChars(len, type) {
        len = len || 16;
        let $chars = '';
        if (type) {
          if (type == 'num') {
            $chars = "1234567890";
          } else {
            $chars = "ABCDEFGHJKMNPQRSTWXYZabcdefhijkmnprstwxyz";
          }
        } else {
          $chars = "ABCDEFGHJKMNPQRSTWXYZabcdefhijkmnprstwxyz2345678";
        }
        let maxPos = $chars.length;
        let pwd = '';
        for (let i = 0; i < len; i++) {
          pwd += $chars.charAt(Math.floor(Math.random() * maxPos));
          if (i == 0 && "2345678".match(pwd)) {
            pwd = '';
            i--;
          }
        }
        return pwd;
      },
      getName() {
        let familyNames = new Array(
          "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈",
          "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
          "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏",
          "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
          "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦",
          "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳",
          "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺",
          "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
          "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余",
          "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹"
        );
        let givenNames = new Array(
          "子璇", "淼", "国栋", "夫子", "瑞堂", "甜", "敏", "尚", "国贤", "贺祥", "晨涛",
          "昊轩", "易轩", "益辰", "益帆", "益冉", "瑾春", "瑾昆", "春齐", "杨", "文昊",
          "东东", "雄霖", "浩晨", "熙涵", "溶溶", "冰枫", "欣欣", "宜豪", "欣慧", "建政",
          "美欣", "淑慧", "文轩", "文杰", "欣源", "忠林", "榕润", "欣汝", "慧嘉", "新建",
          "建林", "亦菲", "林", "冰洁", "佳欣", "涵涵", "禹辰", "淳美", "泽惠", "伟洋",
          "涵越", "润丽", "翔", "淑华", "晶莹", "凌晶", "苒溪", "雨涵", "嘉怡", "佳毅",
          "子辰", "佳琪", "紫轩", "瑞辰", "昕蕊", "萌", "明远", "欣宜", "泽远", "欣怡",
          "佳怡", "佳惠", "晨茜", "晨璐", "运昊", "汝鑫", "淑君", "晶滢", "润莎", "榕汕",
          "佳钰", "佳玉", "晓庆", "一鸣", "语晨", "添池", "添昊", "雨泽", "雅晗", "雅涵",
          "清妍", "诗悦", "嘉乐", "晨涵", "天赫", "玥傲", "佳昊", "天昊", "萌萌", "若萌"
        );
        let firstName = familyNames[Math.floor(Math.random() * familyNames.length)];
        let lastName = givenNames[Math.floor(Math.random() * givenNames.length)];
        return firstName + lastName;
      },
      getGoodsCtegory() {
        let names = ["图书", "音像/杂志", "电子书/听书", "男女装/内衣", "鞋", "运动户外", "箱包皮具", "当当优品", "母婴用品", "孕妈专区", "童装童鞋", "玩具童车",
          "家居家纺", "家具/家装/家饰", "汽车用品", "时尚美妆", "珠宝饰品", "手表/眼镜/礼品", "食品", "健康/营养/保健", "手机通讯", "数码影音", "电脑办公", "家用电器",
          "大家电", "海外购", "地方特色", "文化创意用品"
        ];
        return names[Math.floor(Math.random() * names.length)];
      },
      getGoods() {
        let names = [, "青春文学", "影视写真青春文学", "穿越/重生青春文学", "热血/成长青春文学", "跨界作者", "爆笑/无厘头青春文学", "悬疑/惊悚青春文学", "韩国青春文学", "轻小说",
          "仙侠玄幻青春文学", "大陆原创青春文学", "青春校园文学", "青春爱情文学", "古代言情青春文学", "港台青春文学", "其他国外青春文学", "小说", "小说作品集", "外国小说", "乡土小说",
          "港澳台小说", "历史小说", "社会小说", "官场小说", "职场小说", "科幻小说", "英文原版书-小说", "中国当代小说", "都市小说", "财经小说", "情感小说", "武侠小说",
          "世界名著", "魔幻小说",
          "军事小说", "影视小说", "惊悚/恐怖小说", "侦探/悬疑/推理小说", "四大名著", "中国近现代小说", "中国古典小说", "休闲/爱好", "游戏", "车载户外", "星座/血型/塔罗",
          "宠物杂事",
          "占卜/手相/算命", "日历/台历", "运程/风水", "文学", "外国诗歌", "文学理论", "纪实文学", "中国古诗词", "民间文学", "名家作品", "外国随笔", "戏剧文学",
          "文学评论与鉴赏",
          "中国古代随笔", "文学类考试", "英文原版书-文学", "中国现当代随笔", "文集", "中国现当代诗歌", "孕产/胎教", "孕期", "英文原版书-孕产胎教", "产后管理", "孕产妇健康",
          "孕期饮食指导",
          "孕前准备", "胎教", "艺术", "建筑艺术", "音乐", "影视/媒体艺术", "收藏/鉴赏", "摄影", "民间艺术", "戏剧艺术/舞台艺术", "书法/篆刻", "绘画", "世界各国艺术概况",
          "小人书/连环画",
          "雕塑", "人体艺术", "艺术理论", "英文原版书-艺术", "艺术舞蹈", "艺术类考试", "艺术设计", "工艺美术", "动漫/幽默", "港台漫画", "日韩漫画", "幽默/笑话集", "画集",
          "欧美漫画",
          "世界经典漫画集", "小说/名著漫画版", "游戏同人作品", "图像小说", "动漫同人作品", "动漫学堂", "大陆漫画", "其他国外漫画", "烹饪/美食", "西餐料理", "饮食文化",
          "药膳美食",
          "地方美食", "茶酒饮料", "轻食", "烘焙甜品", "家常菜谱", "英文原版书-美食", "烹饪理论/手册", "时尚/美妆", "服饰搭配/配饰", "瑜珈", "时尚", "彩妆/美发/美甲",
          "奢侈品", "护肤/美容整形",
          "瘦身美体", "旅游/地图", "旅游攻略", "旅游理论与实务", "城市自助旅游指南", "地图", "旅游地图/自驾游", "旅游随笔", "户外探险", "英文原版书-旅游与地理", "国内自助旅游指南",
          "导游领队等专业用书", "旅游摄影/画册", "国外自助旅游指南", "家庭/家居", "家庭园艺", "家装策略秘籍", "英文原版书-家居", "家装方法指导", "家装效果实例", "家事窍门",
          "亲子/家教",
          "成功案例", "7-12岁", "素质教育", "心理疏导", "英文原版书-亲子家教", "家教理论", "13-18岁", "培育女孩", "家教方法", "0-6岁", "品格养成", "培育男孩",
          "亲子关系", "两性关系", "性",
          "恋爱", "婚姻", "两性关系", "育儿/早教", "育儿百科", "英文原版书-育儿早教", "婴幼儿饮食营养", "早教/亲子互动", "婴幼儿护理健康", "保健/养生", "中老年养生", "性保健",
          "食疗养生",
          "运动健康", "男性养生", "饮食健康", "英文原版书-保健养生", "心理健康", "常见病预防和治疗", "健康百科", "女性/儿童", "中医养生", "体育/运动", "篮球", "桥牌",
          "舞蹈", "足球", "围棋",
          "台球", "极限运动", "乒乓球", "跆拳道拳击", "水上运动", "太极", "排球", "规则裁判", "武术/气功", "高尔夫球", "国际象棋", "休闲运动", "网球", "羽毛球",
          "五子棋", "奥林匹克", "象棋",
          "体育理论与教学", "田径/体操", "其它棋牌", "其它运动", "其它球类运动", "手工/DIY", "纸艺", "布艺/不织布", "刺绣/十字绣", "毛线编织/绳编", "羊毛/串珠/粘土",
          "手工材料", "成功/励志",
          "成功/激励", "男性励志", "出国/留学", "礼仪", "人生哲学", "名人励志", "处世学", "青少年励志", "英文原版书-成功励志", "情商/情绪管理", "人在职场", "口才/演讲/辩论",
          "女性励志",
          "性格与习惯", "名言/格言", "励志经典著作", "财商/财富智慧", "人际交往", "智商/智谋", "励志小品", "心灵与修养", "管理", "战略管理", "MBA", "一般管理学", "会计",
          "金融/投资",
          "蟹", "贝", "虾", "鱼", "礼盒/券", "大闸蟹", "营养保健", "海参", "雪蛤", "人参/西洋参", "枸杞", "松茸", "阿胶", "燕窝", "灵芝/孢子粉", "蜂蜜/蜂产品",
          "花卉园艺", "园艺工具", "园艺植物", "鲜花干花"
        ];
        return names[Math.floor(Math.random() * names.length)];
      },
      getRandomInt(max){
        return Math.floor(Math.random() * max);
      }
    }
  }

</script>

<style scoped>


</style>
